# Самостоятеьная практика

string = '1 a1 фb2  c3 abc100 10' # в строке нет русских букв
string = '1 a1 фb2  c3 abc100 10' # в строке нет знаков препинания
file_names = 'main.py run.py app.py flask.py' # все файлы с расширением *.py
cities = 'Анапа \nАнадырь \nАбакан Альметьевск' # в строк нет спецсимволов
quad = '10 25 49 81 100' # в строке все полные квадраты


# https://github.com/nesrv/pt-2.1/blob/main/m1/6%20%D0%9F%D1%80%D0%B0%D0%BA%D1%82%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B5%20%D0%B7%D0%B0%D0%B4%D0%B0%D1%87%D0%B8.md